recipes/M6_wallModelled_CRUISE_LATE/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  7
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 216.65;

boundaryField
{
    wing
    {
        type            zeroGradient;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 216.65;
        value           uniform 216.65;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 216.65;
        value           uniform 216.65;
    }
    outboard
    {
        type            inletOutlet;
        inletValue      uniform 216.65;
        value           uniform 216.65;
    }
    topBottom
    {
        type            inletOutlet;
        inletValue      uniform 216.65;
        value           uniform 216.65;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    #includeEtc "caseDicts/setConstraintTypes"
}
