recipes/M6_wallModelled_CRUISE_LATE/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  7
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;
solver          fluid;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         10000;
deltaT          1;
writeControl    timeStep;
writeInterval   2000;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    #includeFunc MachNo
    #includeFunc residuals

    forceCoeffs1
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        timeInterval    1;
        log             yes;
        patches         (wing);
        rho             rhoInf;
        rhoInf          0.31083;
        magUInf         230.501789;
        // liftDir and dragDir are DERIVED from alpha = 0.9966996379 deg, not
        // inherited. Inheriting them left a 0.803 deg axis lag on the L11 recipe (D019).
        liftDir         (-0.017394813 0.0 0.999848699);
        dragDir         (0.999848699 0.0 0.017394813);
        CofR            (1.34 0.0 0.0);
        pitchAxis       (0 1 0);
        lRef            0.393957;
        Aref            0.620462;
    }

    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
}
